3B/CS343/src/08-Indirect-Communication.org
#+title: Indirect Communication
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* Indirect Communication
~P~ and ~V~ are low-level primitives for protecting critical sections and establishing
synchronization between tasks.

Higher level facilities can perform info communication and mutual exclusion automatically
using help from the programming language and compiler.

* Critical Regions
Declare which variables are shared with syntax like ~VAR v : SHARED INTEGER~.

Access to shared variables is restricted to within a region statement, and within
the region, mutual exclusion is guaranteed:
#+BEGIN_SRC cpp
REGION v DO
// critical section
END REGION
#+END_SRC
This does not allow simultaneous reads.

Can modify to allow reading of shared variables outside the critical region, but this
could bring issues with reading partially updated information that another task is
updating inside the critical region.

Using nesting to attempt to fix this can result in deadlock.

* Conditional Critical Regions
Can fix issues with critical regions using a condition that must be true as well as having
mutual exclusion:
#+BEGIN_SRC cpp
REGION v DO
    AWAIT conditional-expresson
// critical section
END REGION
#+END_SRC

If the condition is false, the region lock is released and entry is started again (busy waiting).
To prevent busy waiting, block on the queue for the shared variable, and on region exit, search
for true conditional-expression and unblock.

* Monitor
*Monitor*: abstract data type that combines shared data with serialization of its modification
#+BEGIN_SRC cpp
_Monitor name {
    // shared data
    // members that see and modify the data
};
#+END_SRC

*Mutex Member*: a member that does not begin execution if there is another active mutex member

A call to a mutex member may become blocked while awaiting entry, and queues of waiting tasks
may form.
Public member routines of a monitor are implicitly mutex. Others can be made mutex with ~_Mutex~.

This works like if the monitor had a lock ~P~'d on entry to a monitor member and ~V~'d on exit.

Recursive entry is allowed, one mutex member can call another or itself.

Unhandled exceptions raised within a monitor should always release the implicit monitor locks
so the monitor can continue to function.

The destructor must be mutex so that closing a monitor blocks if a thread is in the monitor.

* Scheduling (Synchronization)
A monitor may want to schedule tasks in an order different than arrival.

The two techniques are:
- *external*: scheduling tasks outside the monitor and is accomplished with the accept
  statement
- *internal*: scheduling tasks inside the monitor and is accomplished using condition
  variables with signal and wait

External scheduling is easier to specify and explain over internal with condition variables.

External scheduling cannot be used if:
- scheduling depends on member param values
- scheduling must block in the monitor but cannot guarantee the next call fulfills cooperation

** External Scheduling
~_Accept~ controls which mutex members can accept calls.
By preventing members from accepting calls at times, it is possible to control task scheduling.

Each ~_Accept~ defines what cooperation must occur for the accepting task to proceed.
Queues of tasks form outside the monitor, waiting to be accepted.

An acceptor blocks all calls except a call to the specified mutex member(s).
The accepted call is executed like the usual member call.
When the accepted task exits the mutex member, the acceptor continues.

Can satisfy acceptor's requirements with multiple calls.

With external scheduling, unblocking is implicit.

