3B/CS343/08-Indirect-Communication.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-16 Sat 16:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Indirect Communication</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Indirect Communication</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc66ecfa">1. Indirect Communication</a></li>
<li><a href="#orgc947a04">2. Critical Regions</a></li>
<li><a href="#org9c67511">3. Conditional Critical Regions</a></li>
<li><a href="#orga99dafb">4. Monitor</a></li>
<li><a href="#org45d204e">5. Scheduling (Synchronization)</a>
<ul>
<li><a href="#org3e7a50c">5.1. External Scheduling</a></li>
<li><a href="#org9e20847">5.2. Internal Scheduling</a></li>
</ul>
</li>
<li><a href="#org9fea466">6. Readers/Writers</a></li>
<li><a href="#org0bfd0ce">7. Exceptions</a></li>
<li><a href="#org99f4f14">8. Nested Monitor Calls</a></li>
<li><a href="#orgeb3c5b9">9. Intrusive Lists</a></li>
<li><a href="#org2c1ac35">10. Counting Semaphore vs Condition</a></li>
<li><a href="#org458be0f">11. Monitor Types</a></li>
<li><a href="#org9d66381">12. Java Monitor</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc66ecfa" class="outline-2">
<h2 id="orgc66ecfa"><span class="section-number-2">1.</span> Indirect Communication</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>P</code> and <code>V</code> are low-level primitives for protecting critical sections and establishing
synchronization between tasks.
</p>

<p>
Higher level facilities can perform info communication and mutual exclusion automatically
using help from the programming language and compiler.
</p>
</div>
</div>
<div id="outline-container-orgc947a04" class="outline-2">
<h2 id="orgc947a04"><span class="section-number-2">2.</span> Critical Regions</h2>
<div class="outline-text-2" id="text-2">
<p>
Declare which variables are shared with syntax like <code>VAR v : SHARED INTEGER</code>.
</p>

<p>
Access to shared variables is restricted to within a region statement, and within
the region, mutual exclusion is guaranteed:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #a9a1e1;">REGION</span> v DO
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">critical section</span>
<span style="color: #a9a1e1;">END</span> <span style="color: #a9a1e1;">REGION</span>
</pre>
</div>
<p>
This does not allow simultaneous reads.
</p>

<p>
Can modify to allow reading of shared variables outside the critical region, but this
could bring issues with reading partially updated information that another task is
updating inside the critical region.
</p>

<p>
Using nesting to attempt to fix this can result in deadlock.
</p>
</div>
</div>
<div id="outline-container-org9c67511" class="outline-2">
<h2 id="org9c67511"><span class="section-number-2">3.</span> Conditional Critical Regions</h2>
<div class="outline-text-2" id="text-3">
<p>
Can fix issues with critical regions using a condition that must be true as well as having
mutual exclusion:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #a9a1e1;">REGION</span> v DO
    <span style="color: #a9a1e1;">AWAIT</span> conditional-expresson
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">critical section</span>
<span style="color: #a9a1e1;">END</span> <span style="color: #a9a1e1;">REGION</span>
</pre>
</div>

<p>
If the condition is false, the region lock is released and entry is started again (busy waiting).
To prevent busy waiting, block on the queue for the shared variable, and on region exit, search
for true conditional-expression and unblock.
</p>
</div>
</div>
<div id="outline-container-orga99dafb" class="outline-2">
<h2 id="orga99dafb"><span class="section-number-2">4.</span> Monitor</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>Monitor</b>: abstract data type that combines shared data with serialization of its modification
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">_Monitor</span> <span style="color: #dcaeea;">name</span> <span style="color: #51afef;">{</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">shared data</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">members that see and modify the data</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>

<p>
<b>Mutex Member</b>: a member that does not begin execution if there is another active mutex member
</p>

<p>
A call to a mutex member may become blocked while awaiting entry, and queues of waiting tasks
may form.
Public member routines of a monitor are implicitly mutex. Others can be made mutex with <code>_Mutex</code>.
</p>

<p>
This works like if the monitor had a lock <code>P</code>&rsquo;d on entry to a monitor member and <code>V</code>&rsquo;d on exit.
</p>

<p>
Recursive entry is allowed, one mutex member can call another or itself.
</p>

<p>
Unhandled exceptions raised within a monitor should always release the implicit monitor locks
so the monitor can continue to function.
</p>

<p>
The destructor must be mutex so that closing a monitor blocks if a thread is in the monitor.
</p>
</div>
</div>
<div id="outline-container-org45d204e" class="outline-2">
<h2 id="org45d204e"><span class="section-number-2">5.</span> Scheduling (Synchronization)</h2>
<div class="outline-text-2" id="text-5">
<p>
A monitor may want to schedule tasks in an order different than arrival.
</p>

<p>
The two techniques are:
</p>
<ul class="org-ul">
<li><b>external</b>: scheduling tasks outside the monitor and is accomplished with the accept
statement</li>
<li><b>internal</b>: scheduling tasks inside the monitor and is accomplished using condition
variables with signal and wait</li>
</ul>

<p>
External scheduling is easier to specify and explain over internal with condition variables.
</p>

<p>
External scheduling cannot be used if:
</p>
<ul class="org-ul">
<li>scheduling depends on member param values</li>
<li>scheduling must block in the monitor but cannot guarantee the next call fulfills cooperation</li>
</ul>
</div>
<div id="outline-container-org3e7a50c" class="outline-3">
<h3 id="org3e7a50c"><span class="section-number-3">5.1.</span> External Scheduling</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<code>_Accept</code> controls which mutex members can accept calls.
By preventing members from accepting calls at times, it is possible to control task scheduling.
</p>

<p>
Each <code>_Accept</code> defines what cooperation must occur for the accepting task to proceed.
Queues of tasks form outside the monitor, waiting to be accepted.
</p>

<p>
An acceptor blocks all calls except a call to the specified mutex member(s).
The accepted call is executed like the usual member call.
When the accepted task exits the mutex member, the acceptor continues.
</p>

<p>
Can satisfy acceptor&rsquo;s requirements with multiple calls.
</p>

<p>
With external scheduling, unblocking is implicit.
</p>
</div>
</div>
