3B/CS343/08-Indirect-Communication.tex
% Created 2024-11-16 Sat 16:55
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Indirect Communication}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Indirect Communication},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Indirect Communication}
\label{sec:org03fe623}
\texttt{P} and \texttt{V} are low-level primitives for protecting critical sections and establishing
synchronization between tasks.

Higher level facilities can perform info communication and mutual exclusion automatically
using help from the programming language and compiler.
\section{Critical Regions}
\label{sec:org99911fc}
Declare which variables are shared with syntax like \texttt{VAR v : SHARED INTEGER}.

Access to shared variables is restricted to within a region statement, and within
the region, mutual exclusion is guaranteed:
\begin{verbatim}
REGION v DO
// critical section
END REGION
\end{verbatim}
This does not allow simultaneous reads.

Can modify to allow reading of shared variables outside the critical region, but this
could bring issues with reading partially updated information that another task is
updating inside the critical region.

Using nesting to attempt to fix this can result in deadlock.
\section{Conditional Critical Regions}
\label{sec:orgd5ebf47}
Can fix issues with critical regions using a condition that must be true as well as having
mutual exclusion:
\begin{verbatim}
REGION v DO
    AWAIT conditional-expresson
// critical section
END REGION
\end{verbatim}

If the condition is false, the region lock is released and entry is started again (busy waiting).
To prevent busy waiting, block on the queue for the shared variable, and on region exit, search
for true conditional-expression and unblock.
\section{Monitor}
\label{sec:orgbf01056}
\textbf{Monitor}: abstract data type that combines shared data with serialization of its modification
\begin{verbatim}
_Monitor name {
    // shared data
    // members that see and modify the data
};
\end{verbatim}

\textbf{Mutex Member}: a member that does not begin execution if there is another active mutex member

A call to a mutex member may become blocked while awaiting entry, and queues of waiting tasks
may form.
Public member routines of a monitor are implicitly mutex. Others can be made mutex with \texttt{\_Mutex}.

This works like if the monitor had a lock \texttt{P}'d on entry to a monitor member and \texttt{V}'d on exit.

Recursive entry is allowed, one mutex member can call another or itself.

Unhandled exceptions raised within a monitor should always release the implicit monitor locks
so the monitor can continue to function.

The destructor must be mutex so that closing a monitor blocks if a thread is in the monitor.
\section{Scheduling (Synchronization)}
\label{sec:org1591b68}
A monitor may want to schedule tasks in an order different than arrival.

The two techniques are:
\begin{itemize}
\item \textbf{external}: scheduling tasks outside the monitor and is accomplished with the accept
statement
\item \textbf{internal}: scheduling tasks inside the monitor and is accomplished using condition
variables with signal and wait
\end{itemize}

External scheduling is easier to specify and explain over internal with condition variables.

External scheduling cannot be used if:
\begin{itemize}
\item scheduling depends on member param values
\item scheduling must block in the monitor but cannot guarantee the next call fulfills cooperation
\end{itemize}
\subsection{External Scheduling}
\label{sec:orgcd33c94}
\texttt{\_Accept} controls which mutex members can accept calls.
By preventing members from accepting calls at times, it is possible to control task scheduling.

Each \texttt{\_Accept} defines what cooperation must occur for the accepting task to proceed.
Queues of tasks form outside the monitor, waiting to be accepted.

An acceptor blocks all calls except a call to the specified mutex member(s).
The accepted call is executed like the usual member call.
When the accepted task exits the mutex member, the acceptor continues.

Can satisfy acceptor's requirements with multiple calls.

With external scheduling, unblocking is implicit.
