3B/CS343/src/08-Indirect-Communication.org
** Internal Scheduling
Scheduling among tasks inside the monitor.

*Condition*: external synchronization lock
- ~empty~ returns false if there are tasks blocked on the queue and true otherwise
- ~front~ returns an integer value stored with the waiting task at the front of the condition queue
- ~wait~ blocks the current thread and restarts a signalled task or implicitly releases the monitor lock
- ~signal~ unblocks the thread on the front of the condition queue after the signaller thread blocks or
  exits
- ~signalBlock~ unblocks the thread on the front of the condition queue and blocks the signaller thread

A task waits by placing itself on a condition, which atomically places the executing task at the back
of the condition queue and allows another task into the monitor by releasing the monitor lock.

A task is made ready by signalling the condition, which removes and makes ready the blocked task
at the front of the condition queue.

The signaller does not block, so the signalled task must continue waiting until the signaller exits
or waits.

*Entry queue*: FIFO lst of calling tasks to the monitor

* Readers/Writers
Can write similar to ~P~ and ~V~, but can also simplify protocol to have a single read and a single
write action.

Can simplify further by having writers use ~_Mutex~ in monitor (let monitor handle mutual exclusion).

Can solve with condition shadow queue or with external scheduling.

* Exceptions
An exception raised in a monitor member propagates to the caller's thread.

On exiting a method that raised an exception, a caller implicitly raises a nonlocal ~RendezvousFailure~
exception at monitor acceptor's thread to identify failed cooperation.

For multiple ~_Accept~ clauses, a flag variable is required to know which member failed.

* Nested Monitor Calls
*Nested monitor problem*: acquire monitor (lock), call to another monitor, and wait on condition in the
other monitor, so potential deadlock

Releasing all locks can inadvertently release a lock.
This is called the *lock composition* problem.

* Intrusive Lists
Non-contiguous variable-length data structures normally require dynamic allocation as the structure
increases/decreases as the structure increases/decreases when adding/deleting nodes.

The types of collections are copy data, copy pointer, and intrusive pointers.

*Copy* creates a collection node with link fields, with dynamic allocation for links and possibly data,
copying data and/or data pointer into nodes, and then linking the node into collection.

*Intrusive* assumes a node with data and link fields, so no dynamic allocation for collection links or
copying.

A programmer usually manages node lifetime for copy pointer and intrusive.

\mu{}C++ provides *intrusive data structures* allowing global/stack/heap nodes and no copying.
This implementation uses private intrusive links for non-copyable objects like a coroutine or task.

Intrusive links can have:
- one link field, ~uColable~, for a collection
- two link fields, ~uSeqable~, for a sequence

Template classes ~uStack~ and ~uQueue~ are singly linked, so collections.
Template class ~uSequence~ is doubly linked, so sequence.

Each intrusive list has associated iterators, ~uStackIter~, ~uQueueIter~, and ~uSeqIter~.

Lifetime of node is duration of blocked thread.

* Counting Semaphore vs Condition
~P~ only blocks if semaphore is 0, ~wait~ always blocks.

~V~ before ~P~ affects ~P~, ~signal~ before ~wait~ is lost.

Multiple ~V~ can start multiple tasks simultaneously, while multiple signals only start one task at a
time because each task must exit serially through the monitor.

Can simulate ~P~ and ~V~ using a monitor.

