3B/CS343/08-Indirect-Communication.html
<div id="outline-container-org9e20847" class="outline-3">
<h3 id="org9e20847"><span class="section-number-3">5.2.</span> Internal Scheduling</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Scheduling among tasks inside the monitor.
</p>

<p>
<b>Condition</b>: external synchronization lock
</p>
<ul class="org-ul">
<li><code>empty</code> returns false if there are tasks blocked on the queue and true otherwise</li>
<li><code>front</code> returns an integer value stored with the waiting task at the front of the condition queue</li>
<li><code>wait</code> blocks the current thread and restarts a signalled task or implicitly releases the monitor lock</li>
<li><code>signal</code> unblocks the thread on the front of the condition queue after the signaller thread blocks or
exits</li>
<li><code>signalBlock</code> unblocks the thread on the front of the condition queue and blocks the signaller thread</li>
</ul>

<p>
A task waits by placing itself on a condition, which atomically places the executing task at the back
of the condition queue and allows another task into the monitor by releasing the monitor lock.
</p>

<p>
A task is made ready by signalling the condition, which removes and makes ready the blocked task
at the front of the condition queue.
</p>

<p>
The signaller does not block, so the signalled task must continue waiting until the signaller exits
or waits.
</p>

<p>
<b>Entry queue</b>: FIFO lst of calling tasks to the monitor
</p>
</div>
</div>
</div>
<div id="outline-container-org9fea466" class="outline-2">
<h2 id="org9fea466"><span class="section-number-2">6.</span> Readers/Writers</h2>
<div class="outline-text-2" id="text-6">
<p>
Can write similar to <code>P</code> and <code>V</code>, but can also simplify protocol to have a single read and a single
write action.
</p>

<p>
Can simplify further by having writers use <code>_Mutex</code> in monitor (let monitor handle mutual exclusion).
</p>

<p>
Can solve with condition shadow queue or with external scheduling.
</p>
</div>
</div>
<div id="outline-container-org0bfd0ce" class="outline-2">
<h2 id="org0bfd0ce"><span class="section-number-2">7.</span> Exceptions</h2>
<div class="outline-text-2" id="text-7">
<p>
An exception raised in a monitor member propagates to the caller&rsquo;s thread.
</p>

<p>
On exiting a method that raised an exception, a caller implicitly raises a nonlocal <code>RendezvousFailure</code>
exception at monitor acceptor&rsquo;s thread to identify failed cooperation.
</p>

<p>
For multiple <code>_Accept</code> clauses, a flag variable is required to know which member failed.
</p>
</div>
</div>
<div id="outline-container-org99f4f14" class="outline-2">
<h2 id="org99f4f14"><span class="section-number-2">8.</span> Nested Monitor Calls</h2>
<div class="outline-text-2" id="text-8">
<p>
<b>Nested monitor problem</b>: acquire monitor (lock), call to another monitor, and wait on condition in the
other monitor, so potential deadlock
</p>

<p>
Releasing all locks can inadvertently release a lock.
This is called the <b>lock composition</b> problem.
</p>
</div>
</div>
<div id="outline-container-orgeb3c5b9" class="outline-2">
<h2 id="orgeb3c5b9"><span class="section-number-2">9.</span> Intrusive Lists</h2>
<div class="outline-text-2" id="text-9">
<p>
Non-contiguous variable-length data structures normally require dynamic allocation as the structure
increases/decreases as the structure increases/decreases when adding/deleting nodes.
</p>

<p>
The types of collections are copy data, copy pointer, and intrusive pointers.
</p>

<p>
<b>Copy</b> creates a collection node with link fields, with dynamic allocation for links and possibly data,
copying data and/or data pointer into nodes, and then linking the node into collection.
</p>

<p>
<b>Intrusive</b> assumes a node with data and link fields, so no dynamic allocation for collection links or
copying.
</p>

<p>
A programmer usually manages node lifetime for copy pointer and intrusive.
</p>

<p>
&mu;C++ provides <b>intrusive data structures</b> allowing global/stack/heap nodes and no copying.
This implementation uses private intrusive links for non-copyable objects like a coroutine or task.
</p>

<p>
Intrusive links can have:
</p>
<ul class="org-ul">
<li>one link field, <code>uColable</code>, for a collection</li>
<li>two link fields, <code>uSeqable</code>, for a sequence</li>
</ul>

<p>
Template classes <code>uStack</code> and <code>uQueue</code> are singly linked, so collections.
Template class <code>uSequence</code> is doubly linked, so sequence.
</p>

<p>
Each intrusive list has associated iterators, <code>uStackIter</code>, <code>uQueueIter</code>, and <code>uSeqIter</code>.
</p>

<p>
Lifetime of node is duration of blocked thread.
</p>
</div>
</div>
<div id="outline-container-org2c1ac35" class="outline-2">
<h2 id="org2c1ac35"><span class="section-number-2">10.</span> Counting Semaphore vs Condition</h2>
<div class="outline-text-2" id="text-10">
<p>
<code>P</code> only blocks if semaphore is 0, <code>wait</code> always blocks.
</p>

<p>
<code>V</code> before <code>P</code> affects <code>P</code>, <code>signal</code> before <code>wait</code> is lost.
</p>

<p>
Multiple <code>V</code> can start multiple tasks simultaneously, while multiple signals only start one task at a
time because each task must exit serially through the monitor.
</p>

<p>
Can simulate <code>P</code> and <code>V</code> using a monitor.
</p>
</div>
</div>
