3B/CS343/08-Indirect-Communication.tex
\subsection{Internal Scheduling}
\label{sec:orgdfb23c8}
Scheduling among tasks inside the monitor.

\textbf{Condition}: external synchronization lock
\begin{itemize}
\item \texttt{empty} returns false if there are tasks blocked on the queue and true otherwise
\item \texttt{front} returns an integer value stored with the waiting task at the front of the condition queue
\item \texttt{wait} blocks the current thread and restarts a signalled task or implicitly releases the monitor lock
\item \texttt{signal} unblocks the thread on the front of the condition queue after the signaller thread blocks or
exits
\item \texttt{signalBlock} unblocks the thread on the front of the condition queue and blocks the signaller thread
\end{itemize}

A task waits by placing itself on a condition, which atomically places the executing task at the back
of the condition queue and allows another task into the monitor by releasing the monitor lock.

A task is made ready by signalling the condition, which removes and makes ready the blocked task
at the front of the condition queue.

The signaller does not block, so the signalled task must continue waiting until the signaller exits
or waits.

\textbf{Entry queue}: FIFO lst of calling tasks to the monitor
\section{Readers/Writers}
\label{sec:org3067474}
Can write similar to \texttt{P} and \texttt{V}, but can also simplify protocol to have a single read and a single
write action.

Can simplify further by having writers use \texttt{\_Mutex} in monitor (let monitor handle mutual exclusion).

Can solve with condition shadow queue or with external scheduling.
\section{Exceptions}
\label{sec:org08255fd}
An exception raised in a monitor member propagates to the caller's thread.

On exiting a method that raised an exception, a caller implicitly raises a nonlocal \texttt{RendezvousFailure}
exception at monitor acceptor's thread to identify failed cooperation.

For multiple \texttt{\_Accept} clauses, a flag variable is required to know which member failed.
\section{Nested Monitor Calls}
\label{sec:orgcc246d1}
\textbf{Nested monitor problem}: acquire monitor (lock), call to another monitor, and wait on condition in the
other monitor, so potential deadlock

Releasing all locks can inadvertently release a lock.
This is called the \textbf{lock composition} problem.
\section{Intrusive Lists}
\label{sec:orgf66ecc8}
Non-contiguous variable-length data structures normally require dynamic allocation as the structure
increases/decreases as the structure increases/decreases when adding/deleting nodes.

The types of collections are copy data, copy pointer, and intrusive pointers.

\textbf{Copy} creates a collection node with link fields, with dynamic allocation for links and possibly data,
copying data and/or data pointer into nodes, and then linking the node into collection.

\textbf{Intrusive} assumes a node with data and link fields, so no dynamic allocation for collection links or
copying.

A programmer usually manages node lifetime for copy pointer and intrusive.

\(\mu\)C++ provides \textbf{intrusive data structures} allowing global/stack/heap nodes and no copying.
This implementation uses private intrusive links for non-copyable objects like a coroutine or task.

Intrusive links can have:
\begin{itemize}
\item one link field, \texttt{uColable}, for a collection
\item two link fields, \texttt{uSeqable}, for a sequence
\end{itemize}

Template classes \texttt{uStack} and \texttt{uQueue} are singly linked, so collections.
Template class \texttt{uSequence} is doubly linked, so sequence.

Each intrusive list has associated iterators, \texttt{uStackIter}, \texttt{uQueueIter}, and \texttt{uSeqIter}.

Lifetime of node is duration of blocked thread.
\section{Counting Semaphore vs Condition}
\label{sec:org4d68047}
\texttt{P} only blocks if semaphore is 0, \texttt{wait} always blocks.

\texttt{V} before \texttt{P} affects \texttt{P}, \texttt{signal} before \texttt{wait} is lost.

Multiple \texttt{V} can start multiple tasks simultaneously, while multiple signals only start one task at a
time because each task must exit serially through the monitor.

Can simulate \texttt{P} and \texttt{V} using a monitor.
