3B/CS343/src/08-Indirect-Communication.org
* Monitor Types
*Explicit scheduling* occurs when:
- an accept statement blocks the active task on the acceptor stack and makes a task ready from the
  specified mutex member queue
- a signal moves a task from the specified condition to the specified stack

*Implicit scheduling* occurs when a task waits in or exits from a mutex member, and a new task is
selected first from the acceptor/signalled stack, then the entry queue.

Monitors are classified by the implicit scheduling (who gets control) of the monitor when a task waits
or signals or exits.

Implicit scheduling can select from the calling (C), signalled (W), and signaller (S) queues.

Assigning different relative priorities to these queues creates different monitors.

For $C < W < S$ and $C < S < W$, this creates a useful monitor with prevention and no barging.

For $C = W < S$ and $C = S < W$, this creates a useable monitor that needs avoidance and barging, starvation
without avoidance.

The remaining monitors are rejected, either for being confusing or unsound.

Monitors either have an explicit signal or an implicit signal (automatic).
The implicit signal monitor has no condition variables or explicit signal statement.
Instead, there is a ~waitUntil~ statement.

*Immediate-return signal*: additional restricted monitor-type requiring the signaller exit immediately
from the monitor (not powerful enough for all cases, but optimizes common cases)

A no-priority blocking monitor requires the _signaller task_ to recheck the waiting condition in case of
a barging task (use while loop around signal).

A no-priority non-blocking monitor requires the _signalled task_ to recheck the waiting condition in case of
a barging task (use while loop around wait).

A monitor with implicit signalling is good for _prototyping_ but has poor performance.

A priority non-blocking monitor has no barging and optimizes signal before return (supply cooperation).

A priority blocking monitor has no barging and handles internal cooperation within the monitor (wait for
cooperation).

A ~_Cormonitor~ is a coroutine with implicit mutual exclusion on calls to specified member routines.
This means the coroutine can be used my multiple threads.

* Java Monitor
Java has ~synchronized~ class members and a ~synchronized~ statement.

All classes have one implicit condition variable and ~wait~, ~notify~, and ~notifyAll~ to manipulate.

Internal scheduling is no-priority unblocking, so barging: wait statements must be in while loops
to recheck conditions.

One condition queue makes certain solutions difficult or impossible.

*Spurious wakeup*: wakeup when a task is not supposed to wake up

Problems related to spurious wakeup can be solved using generations.

Cannot build condition variables in Java with nested monitors since issues with deadlocks arise
from monitor locks not being released.
