3B/CS343/08-Indirect-Communication.html
<div id="outline-container-org458be0f" class="outline-2">
<h2 id="org458be0f"><span class="section-number-2">11.</span> Monitor Types</h2>
<div class="outline-text-2" id="text-11">
<p>
<b>Explicit scheduling</b> occurs when:
</p>
<ul class="org-ul">
<li>an accept statement blocks the active task on the acceptor stack and makes a task ready from the
specified mutex member queue</li>
<li>a signal moves a task from the specified condition to the specified stack</li>
</ul>

<p>
<b>Implicit scheduling</b> occurs when a task waits in or exits from a mutex member, and a new task is
selected first from the acceptor/signalled stack, then the entry queue.
</p>

<p>
Monitors are classified by the implicit scheduling (who gets control) of the monitor when a task waits
or signals or exits.
</p>

<p>
Implicit scheduling can select from the calling (C), signalled (W), and signaller (S) queues.
</p>

<p>
Assigning different relative priorities to these queues creates different monitors.
</p>

<p>
For \(C < W < S\) and \(C < S < W\), this creates a useful monitor with prevention and no barging.
</p>

<p>
For \(C = W < S\) and \(C = S < W\), this creates a useable monitor that needs avoidance and barging, starvation
without avoidance.
</p>

<p>
The remaining monitors are rejected, either for being confusing or unsound.
</p>

<p>
Monitors either have an explicit signal or an implicit signal (automatic).
The implicit signal monitor has no condition variables or explicit signal statement.
Instead, there is a <code>waitUntil</code> statement.
</p>

<p>
<b>Immediate-return signal</b>: additional restricted monitor-type requiring the signaller exit immediately
from the monitor (not powerful enough for all cases, but optimizes common cases)
</p>

<p>
A no-priority blocking monitor requires the <span class="underline">signaller task</span> to recheck the waiting condition in case of
a barging task (use while loop around signal).
</p>

<p>
A no-priority non-blocking monitor requires the <span class="underline">signalled task</span> to recheck the waiting condition in case of
a barging task (use while loop around wait).
</p>

<p>
A monitor with implicit signalling is good for <span class="underline">prototyping</span> but has poor performance.
</p>

<p>
A priority non-blocking monitor has no barging and optimizes signal before return (supply cooperation).
</p>

<p>
A priority blocking monitor has no barging and handles internal cooperation within the monitor (wait for
cooperation).
</p>

<p>
A <code>_Cormonitor</code> is a coroutine with implicit mutual exclusion on calls to specified member routines.
This means the coroutine can be used my multiple threads.
</p>
</div>
</div>
<div id="outline-container-org9d66381" class="outline-2">
<h2 id="org9d66381"><span class="section-number-2">12.</span> Java Monitor</h2>
<div class="outline-text-2" id="text-12">
<p>
Java has <code>synchronized</code> class members and a <code>synchronized</code> statement.
</p>

<p>
All classes have one implicit condition variable and <code>wait</code>, <code>notify</code>, and <code>notifyAll</code> to manipulate.
</p>

<p>
Internal scheduling is no-priority unblocking, so barging: wait statements must be in while loops
to recheck conditions.
</p>

<p>
One condition queue makes certain solutions difficult or impossible.
</p>

<p>
<b>Spurious wakeup</b>: wakeup when a task is not supposed to wake up
</p>

<p>
Problems related to spurious wakeup can be solved using generations.
</p>

<p>
Cannot build condition variables in Java with nested monitors since issues with deadlocks arise
from monitor locks not being released.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-11-16 Sat 16:55</p>
</div>
</body>
</html>
